Revit 2027 API
IExternalData Interface
 The base interface for data classes used when executing servers of external services.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public interface IExternalData
Public Interface IExternalData
public interface class IExternalData
type IExternalData = interface end
Remarks
 Each and every external service defines a concrete class derived from this interface and adds data and methods as it sees fit for executions of such a particular service.
See Also
Reference
Autodesk.Revit.DB.ExternalService Namespace